# AssetType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Asset..::..AssetType Property
Asset Class See Also
---
The type of RenderingAsset
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AssetType AssetType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AssetType As AssetType
	Get
```

Visual C++
---
```text
public:
property AssetType AssetType {
	AssetType get ();
}
```

# See Also
Asset Class
Autodesk.Revit.DB.Visual Namespace